/** @file

Copyright (c) 2006 - 2014, Byosoft Corporation.<BR>
All rights reserved.This software and associated documentation (if any)
is furnished under a license and may only be used or copied in
accordance with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be reproduced,
stored in a retrieval system, or transmitted in any form or by any
means without the express written consent of Byosoft Corporation.

File Name:
  Pcie.uni

Abstract:
  The definition of string used in Via Video Setup setting.

Revision History:

$END--------------------------------------------------------------------

**/

/=#
#langdef   en-US "English"
#langdef   zh-Hans "\wide中文\narrow"

#string STR_COM_EMPTY                      #language en-US ""
                                           #language zh-Hans ""

                                           
#string STR_PCIE_FORM                       #language en-US "Pcie Configuration"
                                           #language zh-Hans ""
#string STR_PCIE_FORM_HELP                  #language en-US "Pcie Configuration"
                                           #language zh-Hans ""
                                           
#string STR_PCIE_FPGA_MODE                       #language en-US "Pcie FPGA Mode"
                                           #language zh-Hans ""
#string STR_USB_MODE_HELP                  #language en-US "Mode 1:EHCI only mode\nMode 2:EHCI and xHCI mode\nMode 3:xHCI only mode\nMode 4:EHCI and xHCI mode (USB2.0 device on P1~P6 controlled by EHCI and on P7~P9 controlled by xHCI)"
                                           #language zh-Hans ""
#string STR_DISABLED                       #language en-US "Disabled"
                                           #language zh-Hans ""
#string STR_ENABLED                          #language en-US "Enabled"
                                           #language zh-Hans ""
#string STR_RP_LOCK_BIT_CTRL		#language en-US "RP Lock-Bit Control"                 
                                           #language zh-Hans ""

#string STR_PEG_ID_LOCK		#language en-US "PEG(D2F0) ID_Lock Bit"             
                                           #language zh-Hans ""

#string STR_PE0_ID_LOCK		#language en-US "PE0(D3F0) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE1_ID_LOCK		#language en-US "PE1(D3F1) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE2_ID_LOCK		#language en-US "PE2(D3F2) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE3_ID_LOCK		#language en-US "PE3(D3F3) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE4_ID_LOCK		#language en-US "PE4(D4F0) ID_Lock Bit"              
                                           #language zh-Hans ""
#string STR_PE5_ID_LOCK		#language en-US "PE5(D4F1) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE6_ID_LOCK		#language en-US "PE6(D5F0) ID_Lock Bit"          
                                           #language zh-Hans ""
#string STR_PE7_ID_LOCK		#language en-US "PE7(D5F1) ID_Lock Bit"     
                                           #language zh-Hans ""
#string STR_UNLOCK		#language en-US "Unlock"                 
                                           #language zh-Hans ""
#string STR_LOCK	#language en-US "Lock"                 
                                           #language zh-Hans ""

#string STR_MSGC_PIC_INTROUT_CTRL	#language en-US "MSGC PIC INT Routing Control"     
                                           #language zh-Hans ""
#string STR_PEG_MSG2PCIE_INTX	#language en-US "PEG_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE0_MSG2PCIE_INTX	#language en-US "PE0_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE1_MSG2PCIE_INTX	#language en-US "PEG_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE2_MSG2PCIE_INTX	#language en-US "PE2_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE3_MSG2PCIE_INTX	#language en-US "PE3_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE4_MSG2PCIE_INTX	#language en-US "PE4_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE5_MSG2PCIE_INTX	#language en-US "PE5_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE6_MSG2PCIE_INTX	#language en-US "PE6_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PE7_MSG2PCIE_INTX	#language en-US "PE7_MSGC->PCIE_INTx"     
                                           #language zh-Hans ""
#string STR_PCIE_INTA	#language en-US "PCIE_INTA"     
                                           #language zh-Hans ""
#string STR_PCIE_INTB	#language en-US "PCIE_INTB"     
                                           #language zh-Hans ""
#string STR_PCIE_INTC	#language en-US "PCIE_INTC"     
                                           #language zh-Hans ""
#string STR_PCIE_INTD	#language en-US "PCIE_INTD"     
                                           #language zh-Hans ""
#string STR_PEG_PCIE_INTX2NB2SB_INTX	#language en-US "PEG_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE0_PCIE_INTX2NB2SB_INTX	#language en-US "PE0_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE1_PCIE_INTX2NB2SB_INTX	#language en-US "PE1_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE2_PCIE_INTX2NB2SB_INTX	#language en-US "PE2_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE3_PCIE_INTX2NB2SB_INTX	#language en-US "PE3_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE4_PCIE_INTX2NB2SB_INTX	#language en-US "PE4_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE5_PCIE_INTX2NB2SB_INTX	#language en-US "PE5_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE6_PCIE_INTX2NB2SB_INTX	#language en-US "PE6_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_PE7_PCIE_INTX2NB2SB_INTX	#language en-US "PE7_PCIE_INTx Routing"     
                                           #language zh-Hans ""
#string STR_NB2SB_INTA	#language en-US "NB2SB_INTA"     
                                           #language zh-Hans ""
#string STR_NB2SB_INTB	#language en-US "NB2SB_INTB"     
                                           #language zh-Hans ""
#string STR_NB2SB_INTC	#language en-US "NB2SB_INTC"     
                                           #language zh-Hans ""
#string STR_NB2SB_INTD	#language en-US "NB2SB_INTD"     
                                           #language zh-Hans ""
#string STR_MSI_INT_CTRL	#language en-US "MSI Interrupt Control"     
                                           #language zh-Hans ""
#string STR_DISABLE	#language en-US "Disable"     
                                           #language zh-Hans ""
#string STR_ENABLE	#language en-US "Enable"     
                                           #language zh-Hans ""
#string STR_PCIE_ASPM_BOOT_ARCH	#language en-US "ASPM Support in IAPC_Boot_Arch"   

#string STR_PE67_APIC_INT_CTRL							#language en-US "PEG/2/3 APIC INT Routing Control"     
#string STR_PEG_APIC_IRQ								#language en-US "PEG_PCIE_APIC Routing"     
#string STR_PE6_APIC_IRQ								#language en-US "PE6 PCIE_APIC Routing"   
#string STR_PE7_APIC_IRQ								#language en-US "PE7 PCIE_APIC Routing"   
#string STR_INA_IRQ8								#language en-US "INA->IRQ8"     
#string STR_INA_IRQ9								#language en-US "INA->IRQ9"    
#string STR_INA_IRQ10								#language en-US "INA->IRQ10"    
#string STR_INA_IRQ11								#language en-US "INA->IRQ11" 
#string STR_INA_IRQ0								#language en-US "INA->IRQ0"     
#string STR_INA_IRQ1								#language en-US "INA->IRQ1"    
#string STR_INA_IRQ2 							  #language en-US "INA->IRQ2"    
#string STR_INA_IRQ3								#language en-US "INA->IRQ3" 
#string STR_INA_IRQ4								#language en-US "INA->IRQ4"     
#string STR_INA_IRQ5								#language en-US "INA->IRQ5"    
#string STR_INA_IRQ6  							#language en-US "INA->IRQ6"    
#string STR_INA_IRQ7  							#language en-US "INA->IRQ7" 
   
#string STR_PCIERST                                #language en-US "Reset PCIE When Link Fail"
#string STR_PCIE_RST_PEG                                 #language en-US "Reset PEG When Link Fail"
#string STR_PCIE_RST_PE6                               #language en-US "Reset PE6 When Link Fail"
#string STR_PCIE_RST_PE7                                 #language en-US "Reset PE7 When Link Fail"
#string STR_PCIE_RST_PE0                                 #language en-US "Reset PE0 When Link Fail"

#string STR_PCIE_RST_PE1                                 #language en-US "Reset PE1 When Link Fail"
#string STR_PCIE_RST_PE2                                 #language en-US "Reset PE2 When Link Fail"
#string STR_PCIE_RST_PE3                                 #language en-US "Reset PE3 When Link Fail"
#string STR_PCIE_RST_PE4                           #language en-US "Reset PE4 When Link Fail"
#string STR_PCIE_RST_PE5                           #language en-US "Reset PE5 When Link Fail"
#string STR_PCIE_LINK_SPD                      #language en-US "PCIE RP Capability Control"
#string STR_PCIE_PEG_LINK_SPD                      #language en-US "PCIE PEG Capability Control"
#string STR_PCIE_PE0_LINK_SPD                      #language en-US "PCIE PE0 Capability Control"
#string STR_PCIE_PE1_LINK_SPD                      #language en-US "PCIE PE1 Capability Control"
#string STR_PCIE_PE2_LINK_SPD                      #language en-US "PCIE PE2 Capability Control"
#string STR_PCIE_PE3_LINK_SPD                      #language en-US "PCIE PE3 Capability Control"
#string STR_PCIE_PE4_LINK_SPD                      #language en-US "PCIE PE4 Capability Control"
#string STR_PCIE_PE5_LINK_SPD                      #language en-US "PCIE PE5 Capability Control"
#string STR_PCIE_PE6_LINK_SPD                      #language en-US "PCIE PE6 Capability Control"
#string STR_PCIE_PE7_LINK_SPD                      #language en-US "PCIE PE7 Capability Control"


#string STR_AUTO                              #language en-US "Auto"
#string STR_FORCE_GEN1                                #language en-US "Force Gen1"
#string STR_FORCE_GEN2                                #language en-US "Force Gen2"
#string STR_FORCE_GEN3                                #language en-US "Force Gen3"
#string STR_FORCE_BY_PORT                                #language en-US "By Port"

#string STR_PCIE_FORCE_LINK_WIDTH		#language en-US "Force Link Width select"
#string STR_PCIE_FORCE_DEFAULT			#language en-US "Use default"
#string STR_PCIE_FORCE_X1			#language en-US "Force X1"

#string STR_PCIE_EQ                                #language en-US "PCIE EQ Control"
#string STR_DO_EQ                                #language en-US "Do EQ"
#string STR_SKIP_WITH_TABLE                                #language en-US "Skip EQ with Look-up Preset Table"
#string STR_SKIP_WITH_MANUAL                                #language en-US "Skip EQ with Manual Preset"

#string STR_TX_PRESET_PROMPT				#language en-US "Set DoEQ Tx Preset Value"
#string STR_TX_PRESET_HELP				#language en-US "Set DoEQ Tx Preset Value"
#string STR_TXPRESET0					#language en-US "Use DoEQ Tx Preset Value 0"
#string STR_TXPRESET1					#language en-US "Use DoEQ Tx Preset Value 1"
#string STR_TXPRESET2					#language en-US "Use DoEQ Tx Preset Value 2"
#string STR_TXPRESET3					#language en-US "Use DoEQ Tx Preset Value 3"
#string STR_TXPRESET4					#language en-US "Use DoEQ Tx Preset Value 4"
#string STR_TXPRESET5					#language en-US "Use DoEQ Tx Preset Value 5"
#string STR_TXPRESET6					#language en-US "Use DoEQ Tx Preset Value 6"
#string STR_TXPRESET7					#language en-US "Use DoEQ Tx Preset Value 7"
#string STR_TXPRESET8					#language en-US "Use DoEQ Tx Preset Value 8"
#string STR_TXPRESET9					#language en-US "Use DoEQ Tx Preset Value 9"
#string STR_TXPRESET10					#language en-US "Use DoEQ Tx Preset Value 10"

#string STR_EQ_CTL_ORG_VAL_L0_HELP                       #language en-US "[14:12] is UpPort Rx Hint, [11:8] is UpPort Tx Preset, [6:4] is DnPort Rx Hint, [3:0] is DnPort Tx Preset"
#string STR_EQ_CTL_ORG_VAL_L0                            #language en-US "Manual Preset - PHA_L0"
#string STR_EQ_CTL_ORG_VAL_L1                            #language en-US "Manual Preset - PHA_L1"
#string STR_EQ_CTL_ORG_VAL_L2                            #language en-US "Manual Preset - PHA_L2"
#string STR_EQ_CTL_ORG_VAL_L3                            #language en-US "Manual Preset - PHA_L3"
#string STR_EQ_CTL_ORG_VAL_L4                            #language en-US "Manual Preset - PHA_L4"
#string STR_EQ_CTL_ORG_VAL_L5                            #language en-US "Manual Preset - PHA_L5"
#string STR_EQ_CTL_ORG_VAL_L6                            #language en-US "Manual Preset - PHA_L6"
#string STR_EQ_CTL_ORG_VAL_L7                            #language en-US "Manual Preset - PHA_L7"
#string STR_EQ_CTL_ORG_VAL_L8                            #language en-US "Manual Preset - PHA_L8"
#string STR_EQ_CTL_ORG_VAL_L9                            #language en-US "Manual Preset - PHA_L9"
#string STR_EQ_CTL_ORG_VAL_L10                            #language en-US "Manual Preset - PHA_L10"
#string STR_EQ_CTL_ORG_VAL_L11                            #language en-US "Manual Preset - PHA_L11"
#string STR_EQ_CTL_ORG_VAL_L12                            #language en-US "Manual Preset - PHA_L12"
#string STR_EQ_CTL_ORG_VAL_L13                            #language en-US "Manual Preset - PHA_L13"
#string STR_EQ_CTL_ORG_VAL_L14                            #language en-US "Manual Preset - PHB_L0"
#string STR_EQ_CTL_ORG_VAL_L15                            #language en-US "Manual Preset - PHB_L1"

#string STR_PCIE_EQ_TS2                            #language en-US "EQ TS2"

#string STR_PCIE_CRS_MECH                            #language en-US "CRS Handling Method "
#string STR_PCIE_CRS_MECH_SW_VISIABLE                #language en-US "SW Visiable"
#string STR_PCIE_CRS_MECH_HW_RETRY                	#language en-US "HW Retry"
#string STR_PCIE_CRS_MECH_ALL_FF               		#language en-US "ALL FF"
#string STR_PCIE_CRS_MECH_HELP                       #language en-US " "

#string STR_PCIE_OPTIMAL_TLS                         #language en-US "RP TLS Depend on Device"
#string STR_PCIE_OPTIMAL_TLS_HELP                    #language en-US "RP will set TLS depend on capability of Device behind it"


#string STR_EMPTY                              #language en-US " "
#string STR_PCIE_RP                               #language en-US "PCIE Root Port"
#string STR_PCIE_PE0                           #language en-US "PCIE PE0 Control"
#string STR_PCIE_PE0_HELP                      #language en-US "PCIE PE0 can't be disabled when PE1/PE2/PE3 is enabled"
#string STR_PCIE_PE1                          #language en-US "PCIE PE1 Control"
#string STR_PCIE_PE2                           #language en-US "PCIE PE2 Control"
#string STR_PCIE_PE3                           #language en-US "PCIE PE3 Control"
#string STR_PCIE_PEG                      #language en-US "PCIE PEG Control"
#string STR_PCIE_PE6                     #language en-US "PCIE PE6 Control"
#string STR_PCIE_PE6_HELP                      #language en-US "PCIE PE6 can't be disabled when PE7 is enabled"
#string STR_PCIE_PE7                      #language en-US "PCIE PE7 Control"
#string STR_PCIE_PE4                      #language en-US "PCIE PE4 Control"
#string STR_PCIE_PE4_HELP                      #language en-US "PCIE PE4 can't be disabled when PE5 is enabled"
#string STR_PCIE_PE5                              #language en-US "PCIE PE5 Control"
#string STR_PCIE_HOTRST                                #language en-US "PCIE Hot-Reset Enable"
#string STR_PEMCU_LOADFW_WHENBOOT                                #language en-US "PEMCU Auto Load FW Eanble"
#string STR_PEMCU_RSTSYS_WHENFAIL                                #language en-US "PEMCU Reset When load FW fail"
#string STR_PCIE_OBFF_CTRL_PCIE                                #language en-US "PCIE OBFF Control"
#string STR_SELECT_DE_EMPHASIS                                #language en-US "Selectable De-emphasis"
#string STR_SELECT_DE_EMPHASIS_HELP                                #language en-US "When the link is operating at 5.0 GT/s speed, this option selects the level of de-emphasis for an upstream component."
#string STR_DE_EMPHESIS_SI_TABLE		#language en-US "Select By SI table"
#string STR_M6P0DB                                #language en-US "-6.0dB"
#string STR_M3P5DB                                #language en-US "-3.5dB"

#string STR_OBFF_WITH_PEXWAKE                                #language en-US "PCIE OBFF with PEXWAKE#"
#string STR_OBFF_WITH_MESSAGEA                                #language en-US "PCIE OBFF with Message A"
#string STR_OBFF_WITH_MESSAGEB                                #language en-US "PCIE OBFF with Message B"
#string STR_MAT_PAYLOAD_SIZE                               #language en-US "Maximum Payload Size"
#string STR_KERNAL_CTRL_ITEMS                               #language en-US "Kernel Controlled Items"
#string STR_MAX_128M                           #language en-US "Max to 128 Bytes"
#string STR_MAX_256M                      #language en-US "Max to 256 Bytes"
#string STR_PCIE_ASPM                              #language en-US "Active State Power Management"
#string STR_RELAX_ORDER                                #language en-US "Relax Ordering"
#string STR_EXT_TAG                               #language en-US "Extended Tag Field"
#string STR_NO_SNOOP                           #language en-US "No Snoop"
#string STR_EXT_SYNC                      #language en-US "Extended Sync"
#string STR_SPECIALLY_SI_SETTING                      #language en-US "Specially SI setting for test"
#string STR_PCIE_SPECIALLY_SI_BIST                      #language en-US "STR_PCIE_SPECIALLY_SI_BIST"
#string STR_PCIE_ROUT_CTRL                      #language en-US "PCIE APIC/PIC Routing test"
#string STR_PCIE_GEN3_EQ_CTRL                      #language en-US "PCIE Gen3 Equalization"
#string STR_EXT_SYNC                      #language en-US "Extended Sync"
#string STR_PCIE_OBFF_CTRL_PMU                      #language en-US "PCIE OBFF Control PMU"
#string STR_OBFF_CXCMD_MODE                      #language en-US "OBFF CxCmd Mode"
#string STR_OBFF_CXSIGNAL_MODE                      #language en-US "OBFF Cxsignal Mode"          

#string STR_PCI64                           #language en-US "Above 4G Decoding"
#string STR_PCI64_HELP                      #language en-US "64 bit prefetchable BAR can be allocated above 4G MMIO"      
#string STR_PCI64_LOCATION                  #language en-US "Location of above 4G MMIO"
#string STR_PCI64_LOCATION_HELP             #language en-US "Location of above 4G MMIO"
#string STR_BELOW_512G                      #language en-US "At Top of 512G"
#string STR_BELOW_256G                      #language en-US "At Top of 256G"
#string STR_BELOW_128G                      #language en-US "At Top of 128G"
#string STR_BELOW_64G                       #language en-US "At Top of 64G"
#string STR_BELOW_1T                        #language en-US "At Top of 1TB"         